ElectronicCats/circuitpython/ports/nrf/boards/bast_frontier/mpconfigboard.h
#include "nrfx/hal/nrf_gpio.h"

#define MICROPY_HW_BOARD_NAME       "Bast Frontier"
#define MICROPY_HW_MCU_NAME         "nRF52840"

// No 32kHz crystal. THere's a 32MHz crystal in the nRF module.
#define BOARD_HAS_32KHZ_XTAL (0)

#define DEFAULT_I2C_BUS_SCL         (&pin_P0_14)
#define DEFAULT_I2C_BUS_SDA         (&pin_P0_13)

#define DEFAULT_SPI_BUS_SCK         (&pin_P0_03)
#define DEFAULT_SPI_BUS_MOSI        (&pin_P0_26)
#define DEFAULT_SPI_BUS_MISO        (&pin_P0_30)

#define DEFAULT_UART_BUS_RX         (&pin_P0_19)
#define DEFAULT_UART_BUS_TX         (&pin_P0_20)
